# Cable Size Hot Conductor Size Property

Source: https://www.revitapidocs.com/2026/cf1e62a7-e1f4-4073-77b5-899dac861398.htm

---

| Cable Size Hot Conductor Size Property |
| --- |

The size of a Hot Conductor.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId HotConductorSize { get; set; }
```

```
Public Property HotConductorSize As ElementId
	Get
	Set
```

```
public:
property ElementId^ HotConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member HotConductorSize : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Size id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks Each Hot Conductor has the same size. See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace